# DataFrame

The object DataFrame of the package pandas represents a table of data. Each column is a Series; the columns share a common index.

In [1]:
# print all the outputs in a cell
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

import pandas as pd
import numpy as np

In [2]:
%autosave 0

Autosave disabled

## Create a DataFrame

### From cmd

In [3]:
pd.DataFrame({'Apples': [30], 'Bananas': [21]})

   Apples  Bananas
0      30       21

In [4]:
df_fruit = pd.DataFrame(
    {'Apples': [35, 41], 'Bananas': [21, 34]},\
    index=['2017 Sales', '2018 Sales']
)

In [5]:
df_fruit

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34

### Write to a file

In [6]:
df_fruit.to_csv("fruit.csv")

In [7]:
ls

MSIS2802-Module 4-DataFrame.pdf
MSIS2802-Module 4-DataFrame.pptx
MSIS2802-Module 5-data cleaning.pdf
MSIS2802-Module 5-data cleaning.pptx
Module 6 -- group by.pdf
Module 6 -- group by.pptx*
data science survey.csv
fruit.csv
module 4 -- data frame-Copy1.ipynb
module 4 -- data frame.ipynb
module 5 -- cleaning and summary stats.ipynb
module 6 group by - template-02-11-2019.ipynb*
module 6 group by.ipynb*
students.csv
~$MSIS2802-Module 4-DataFrame.pptx

### From a file

Place the data file in the same folder as the ipynb file. Then, read it as follows:

In [11]:
df = pd.read_csv('students 2.csv')

In [12]:
df

         Name   hw1   hw2 program
0      Dorian  10.0  10.0    MSIS
1    Jeannine   6.0   7.0    MSIS
2   Iluminada   2.0   NaN     MBA
3        Luci   7.0   7.0    MSIS
4       Jenny   8.0   NaN     NaN
5    Demetria   2.0   4.0    MSIS
6     Michael   6.0  10.0     MBA
7     Garland   9.0   1.0    MSIS
8      Shelby   1.0  10.0    MSIS
9       Mercy   5.0   6.0    MSIS
10       John   NaN  10.0    MSIS

By the default, the index is 0, 1, ...

Let us set the index as the column "Name".

In [13]:
df = df.set_index('Name')

In [14]:
df

            hw1   hw2 program
Name
Dorian     10.0  10.0    MSIS
Jeannine    6.0   7.0    MSIS
Iluminada   2.0   NaN     MBA
Luci        7.0   7.0    MSIS
Jenny       8.0   NaN     NaN
Demetria    2.0   4.0    MSIS
Michael     6.0  10.0     MBA
Garland     9.0   1.0    MSIS
Shelby      1.0  10.0    MSIS
Mercy       5.0   6.0    MSIS
John        NaN  10.0    MSIS

## index, columns, values

<b>index</b> returns the index labels

In [15]:
df.index

Index(['Dorian', 'Jeannine', 'Iluminada', 'Luci', 'Jenny', 'Demetria',
       'Michael', 'Garland', 'Shelby', 'Mercy', 'John'],
      dtype='object', name='Name')

<b>columns</b> returns the list of column names (as an index object)

In [16]:
df.columns

Index(['hw1', 'hw2', 'program'], dtype='object')

<b>values</b> returns a (2-dimensional) ndarray of values

In [17]:
df.values

array([[10.0, 10.0, 'MSIS'],
       [6.0, 7.0, 'MSIS'],
       [2.0, nan, 'MBA'],
       [7.0, 7.0, 'MSIS'],
       [8.0, nan, nan],
       [2.0, 4.0, 'MSIS'],
       [6.0, 10.0, 'MBA'],
       [9.0, 1.0, 'MSIS'],
       [1.0, 10.0, 'MSIS'],
       [5.0, 6.0, 'MSIS'],
       [nan, 10.0, 'MSIS']], dtype=object)

In [18]:
type(df.values)

numpy.ndarray

## df.iloc[x, y]

Access using the positional index. 
<ul>
<li><b>x</b> is the information needed to select the rows: positional index or range of integers</li>
<li><b>y (optional)</b> is the information needed to select the columns: positional index or range of integers</li>
</ul>

Access one row by specifying a positional index

In [19]:
df.iloc[2,:]

hw1          2
hw2        NaN
program    MBA
Name: Iluminada, dtype: object

In [20]:
df

            hw1   hw2 program
Name
Dorian     10.0  10.0    MSIS
Jeannine    6.0   7.0    MSIS
Iluminada   2.0   NaN     MBA
Luci        7.0   7.0    MSIS
Jenny       8.0   NaN     NaN
Demetria    2.0   4.0    MSIS
Michael     6.0  10.0     MBA
Garland     9.0   1.0    MSIS
Shelby      1.0  10.0    MSIS
Mercy       5.0   6.0    MSIS
John        NaN  10.0    MSIS

Or, more simply:

In [21]:
df.iloc[2]

hw1          2
hw2        NaN
program    MBA
Name: Iluminada, dtype: object

Access one column by specifying positional index of the column

In [22]:
df.iloc[:,1]

Name
Dorian       10.0
Jeannine      7.0
Iluminada     NaN
Luci          7.0
Jenny         NaN
Demetria      4.0
Michael      10.0
Garland       1.0
Shelby       10.0
Mercy         6.0
John         10.0
Name: hw2, dtype: float64

Access one specific value

In [23]:
df.iloc[2,1]

nan

Access a subset of rows and of columns

In [24]:
df.iloc[:5,-2:]

            hw2 program
Name
Dorian     10.0    MSIS
Jeannine    7.0    MSIS
Iluminada   NaN     MBA
Luci        7.0    MSIS
Jenny       NaN     NaN

## df.loc[x, y]

Access using the index labels. 
<ul>
<li><b>x</b> is the information needed to select the rows: label index, range of index labels, or boolean masks</li>
<li><b>y (optional)</b> is the information needed to select the columns: label index, range of index labels, or boolean masks</li>
</ul>

Acccess one specific value by specifying index label and column name

In [25]:
df

            hw1   hw2 program
Name
Dorian     10.0  10.0    MSIS
Jeannine    6.0   7.0    MSIS
Iluminada   2.0   NaN     MBA
Luci        7.0   7.0    MSIS
Jenny       8.0   NaN     NaN
Demetria    2.0   4.0    MSIS
Michael     6.0  10.0     MBA
Garland     9.0   1.0    MSIS
Shelby      1.0  10.0    MSIS
Mercy       5.0   6.0    MSIS
John        NaN  10.0    MSIS

In [26]:
df.loc['Garland','hw2']

1.0

Access one row by specifying index label

In [27]:
df.loc['Garland',:]

hw1           9
hw2           1
program    MSIS
Name: Garland, dtype: object

or, more simply:

In [28]:
df.loc['Garland']

hw1           9
hw2           1
program    MSIS
Name: Garland, dtype: object

Access one column by specifying index label

In [29]:
df.loc[:,'hw1']

Name
Dorian       10.0
Jeannine      6.0
Iluminada     2.0
Luci          7.0
Jenny         8.0
Demetria      2.0
Michael       6.0
Garland       9.0
Shelby        1.0
Mercy         5.0
John          NaN
Name: hw1, dtype: float64

Or, more simply:

In [30]:
df['hw1']

Name
Dorian       10.0
Jeannine      6.0
Iluminada     2.0
Luci          7.0
Jenny         8.0
Demetria      2.0
Michael       6.0
Garland       9.0
Shelby        1.0
Mercy         5.0
John          NaN
Name: hw1, dtype: float64

In [31]:
df.hw1

Name
Dorian       10.0
Jeannine      6.0
Iluminada     2.0
Luci          7.0
Jenny         8.0
Demetria      2.0
Michael       6.0
Garland       9.0
Shelby        1.0
Mercy         5.0
John          NaN
Name: hw1, dtype: float64

Common mistake: get the whole row about Lucy

In [34]:
df['Lucy']

KeyError: 'Lucy'

In [35]:
df.loc['Lucy']

KeyError: 'the label [Lucy] is not in the [index]'

Select those students whose name starts with 'J'

In [36]:
df.loc[(df.index >= 'J') & (df.index < 'K'),:]

          hw1   hw2 program
Name
Jeannine  6.0   7.0    MSIS
Jenny     8.0   NaN     NaN
John      NaN  10.0    MSIS

## Problems

#### Retrieve Shelby's hw1 grade

In [37]:
df.loc['Shelby','hw1']

1.0

#### Retrieve Shelby's information

In [38]:
df.loc['Shelby']

hw1           1
hw2          10
program    MSIS
Name: Shelby, dtype: object

#### Find all information about those students that obtained the highest grade in hw2. Note that there are ties

In [39]:
df.hw2.nlargest(1)

Name
Dorian    10.0
Name: hw2, dtype: float64

In [40]:
df.hw2.nlargest()

Name
Dorian      10.0
Michael     10.0
Shelby      10.0
John        10.0
Jeannine     7.0
Name: hw2, dtype: float64

So there are ties with grade equal to 10. Need to use .max() and boolean mask.

In [41]:
df.hw2.max()

10.0

In [42]:
df[df.hw2 == df.hw2.max()]

          hw1   hw2 program
Name
Dorian   10.0  10.0    MSIS
Michael   6.0  10.0     MBA
Shelby    1.0  10.0    MSIS
John      NaN  10.0    MSIS

#### Find those students who obtained the same score in hw1 and in hw2.

In [43]:
df[df.hw1 == df.hw2]

         hw1   hw2 program
Name
Dorian  10.0  10.0    MSIS
Luci     7.0   7.0    MSIS

In [44]:
df.loc[df.hw1 == df.hw2]

         hw1   hw2 program
Name
Dorian  10.0  10.0    MSIS
Luci     7.0   7.0    MSIS

#### Find the average hw1 score of those students who got a hw2 score greater than 5.

In [45]:
df[df.hw2 > 5].hw1.mean()

5.833333333333333

## sort_values()

Sort the table based on the values of a set of columns (parameter <b>by</b>).

Sorting by one column

In [46]:
df.sort_values(by='hw1', ascending=False)

            hw1   hw2 program
Name
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Jenny       8.0   NaN     NaN
Luci        7.0   7.0    MSIS
Jeannine    6.0   7.0    MSIS
Michael     6.0  10.0     MBA
Mercy       5.0   6.0    MSIS
Iluminada   2.0   NaN     MBA
Demetria    2.0   4.0    MSIS
Shelby      1.0  10.0    MSIS
John        NaN  10.0    MSIS

Sorting by more columns. For example, by hw1 descending and, in case of ties, by hw2 ascending

In [47]:
df.sort_values(by=['hw1','hw2'],ascending=[False,True])

            hw1   hw2 program
Name
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Jenny       8.0   NaN     NaN
Luci        7.0   7.0    MSIS
Jeannine    6.0   7.0    MSIS
Michael     6.0  10.0     MBA
Mercy       5.0   6.0    MSIS
Demetria    2.0   4.0    MSIS
Iluminada   2.0   NaN     MBA
Shelby      1.0  10.0    MSIS
John        NaN  10.0    MSIS

## sort_index

In [48]:
df.sort_index()

            hw1   hw2 program
Name
Demetria    2.0   4.0    MSIS
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Iluminada   2.0   NaN     MBA
Jeannine    6.0   7.0    MSIS
Jenny       8.0   NaN     NaN
John        NaN  10.0    MSIS
Luci        7.0   7.0    MSIS
Mercy       5.0   6.0    MSIS
Michael     6.0  10.0     MBA
Shelby      1.0  10.0    MSIS

## head and tail

Returns the first (or last) n rows

In [49]:
df.head()

            hw1   hw2 program
Name
Dorian     10.0  10.0    MSIS
Jeannine    6.0   7.0    MSIS
Iluminada   2.0   NaN     MBA
Luci        7.0   7.0    MSIS
Jenny       8.0   NaN     NaN

In [50]:
df.tail()

         hw1   hw2 program
Name
Michael  6.0  10.0     MBA
Garland  9.0   1.0    MSIS
Shelby   1.0  10.0    MSIS
Mercy    5.0   6.0    MSIS
John     NaN  10.0    MSIS

## Problems

#### Sort the MSIS students by hw2 descending.

In [51]:
df[df.program == 'MSIS'].sort_values(by='hw2',ascending=False)

           hw1   hw2 program
Name
Dorian    10.0  10.0    MSIS
Shelby     1.0  10.0    MSIS
John       NaN  10.0    MSIS
Jeannine   6.0   7.0    MSIS
Luci       7.0   7.0    MSIS
Mercy      5.0   6.0    MSIS
Demetria   2.0   4.0    MSIS
Garland    9.0   1.0    MSIS

####  Show <b>only</b> the field <i>hw1</i> of the students with the largest hw2 grade

In [52]:
df[df.hw2==df.hw2.max()].hw1

Name
Dorian     10.0
Michael     6.0
Shelby      1.0
John        NaN
Name: hw1, dtype: float64

In [53]:
df[df.hw2==df.hw2.max()].loc[:,'hw1']

Name
Dorian     10.0
Michael     6.0
Shelby      1.0
John        NaN
Name: hw1, dtype: float64

## mean, min, max, etc

Aggregate functions are broadcasted to all columns (axis = 0, which is the default) or rows (axis = 1). Numeric aggregators will be executed only on numeric data.

The average for each hw

In [54]:
df.mean()

hw1    5.600000
hw2    7.222222
dtype: float64

The average for each student

In [55]:
df.mean(axis = 1)

Name
Dorian       10.0
Jeannine      6.5
Iluminada     2.0
Luci          7.0
Jenny         8.0
Demetria      3.0
Michael       8.0
Garland       5.0
Shelby        5.5
Mercy         5.5
John         10.0
dtype: float64

In [56]:
df.max()

hw1    10.0
hw2    10.0
dtype: float64

## Problems

#### Compute the spread (i.e., highest minus lowest hw grade) of each student

let's try to use .max(axis=1) , find each row/student's max. Use .min(axis=1) to find the min.

In [57]:
df

            hw1   hw2 program
Name
Dorian     10.0  10.0    MSIS
Jeannine    6.0   7.0    MSIS
Iluminada   2.0   NaN     MBA
Luci        7.0   7.0    MSIS
Jenny       8.0   NaN     NaN
Demetria    2.0   4.0    MSIS
Michael     6.0  10.0     MBA
Garland     9.0   1.0    MSIS
Shelby      1.0  10.0    MSIS
Mercy       5.0   6.0    MSIS
John        NaN  10.0    MSIS

In [58]:
df.max(axis=1) - df.min(axis=1)

Name
Dorian       0.0
Jeannine     1.0
Iluminada    0.0
Luci         0.0
Jenny        0.0
Demetria     2.0
Michael      4.0
Garland      8.0
Shelby       9.0
Mercy        1.0
John         0.0
dtype: float64

Or

In [59]:
(df.hw1 - df.hw2).abs()

Name
Dorian       0.0
Jeannine     1.0
Iluminada    NaN
Luci         0.0
Jenny        NaN
Demetria     2.0
Michael      4.0
Garland      8.0
Shelby       9.0
Mercy        1.0
John         NaN
dtype: float64

In [60]:
(df.loc[:,'hw1'] - df.loc[:, 'hw2']).abs()

Name
Dorian       0.0
Jeannine     1.0
Iluminada    NaN
Luci         0.0
Jenny        NaN
Demetria     2.0
Michael      4.0
Garland      8.0
Shelby       9.0
Mercy        1.0
John         NaN
dtype: float64

What happen if the table has more than two homework columns ?

In [56]:
(df.columns > 'hw') & (df.columns < 'i')

array([ True,  True, False])

In [57]:
hw = df.loc[:,(df.columns > 'hw') & (df.columns < 'i')]

In [58]:
hw

            hw1   hw2
Name
Demetria    2.0   4.0
Dorian     10.0  10.0
Garland     9.0   1.0
Iluminada   2.0   NaN
Jeannine    6.0   7.0
Jenny       8.0   NaN
John        NaN  10.0
Lucy        7.0   7.0
Mercy       5.0   6.0
Michael     6.0  10.0
Shelby      1.0  10.0

In [59]:
spread = hw.max(axis = 1) - hw.min(axis = 1)
spread

Name
Demetria     2.0
Dorian       0.0
Garland      8.0
Iluminada    0.0
Jeannine     1.0
Jenny        0.0
John         0.0
Lucy         0.0
Mercy        1.0
Michael      4.0
Shelby       9.0
dtype: float64

#### Who has the largest spread?

In [60]:
spread.nlargest(1)

Name
Shelby    9.0
dtype: float64

## Modifying DataFrames

Make a copy of the data frame

In [61]:
df2 = df.copy()

### Add rows

A new student has joined. His name is Oliver and he is the MSIS program; his hw1 is missing and his hw2 score is 8.

In [62]:
df2.loc['Oliver'] = [np.nan, 8, 'MSIS']

In [63]:
df2

            hw1   hw2 program
Name
Demetria    2.0   4.0    MSIS
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Iluminada   2.0   NaN     MBA
Jeannine    6.0   7.0    MSIS
Jenny       8.0   NaN     NaN
John        NaN  10.0    MSIS
Lucy        7.0   7.0    MSIS
Mercy       5.0   6.0    MSIS
Michael     6.0  10.0     MBA
Shelby      1.0  10.0    MSIS
Oliver      NaN   8.0    MSIS

A new student has joined. Her name is Caroline and she got 4 in hw2. She is not in any program yet.

In [64]:
df2.loc['Caroline','hw2'] = 4

In [65]:
df2

            hw1   hw2 program
Name
Demetria    2.0   4.0    MSIS
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Iluminada   2.0   NaN     MBA
Jeannine    6.0   7.0    MSIS
Jenny       8.0   NaN     NaN
John        NaN  10.0    MSIS
Lucy        7.0   7.0    MSIS
Mercy       5.0   6.0    MSIS
Michael     6.0  10.0     MBA
Shelby      1.0  10.0    MSIS
Oliver      NaN   8.0    MSIS
Caroline    NaN   4.0     NaN

### Add columns

Add an "empty" column <b>hw3</b>

In [66]:
df2 = df.copy()

In [67]:
df2['hw3'] = np.nan

In [68]:
df2

            hw1   hw2 program  hw3
Name
Demetria    2.0   4.0    MSIS  NaN
Dorian     10.0  10.0    MSIS  NaN
Garland     9.0   1.0    MSIS  NaN
Iluminada   2.0   NaN     MBA  NaN
Jeannine    6.0   7.0    MSIS  NaN
Jenny       8.0   NaN     NaN  NaN
John        NaN  10.0    MSIS  NaN
Lucy        7.0   7.0    MSIS  NaN
Mercy       5.0   6.0    MSIS  NaN
Michael     6.0  10.0     MBA  NaN
Shelby      1.0  10.0    MSIS  NaN

### Add calculated columns

In [69]:
df2 = df.copy()

Let's add a column with the final grade. It is computed as 0.2\*hw1 + 0.8\*hw2.

In [70]:
df2['finalGrade'] = 0.2 * df2.hw1 + 0.8 * df.hw2
df2

            hw1   hw2 program  finalGrade
Name
Demetria    2.0   4.0    MSIS         3.6
Dorian     10.0  10.0    MSIS        10.0
Garland     9.0   1.0    MSIS         2.6
Iluminada   2.0   NaN     MBA         NaN
Jeannine    6.0   7.0    MSIS         6.8
Jenny       8.0   NaN     NaN         NaN
John        NaN  10.0    MSIS         NaN
Lucy        7.0   7.0    MSIS         7.0
Mercy       5.0   6.0    MSIS         5.8
Michael     6.0  10.0     MBA         9.2
Shelby      1.0  10.0    MSIS         8.2